Revit 2024 API
ViewShapeBuilder.AddCurve Method
 Add a curve to the GRep associated to this ViewShapeBuilder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void AddCurve(
	Curve GCurve
)
Visual Basic
Public Sub AddCurve ( _
	GCurve As Curve _
)
Visual C++
public:
void AddCurve(
	Curve^ GCurve
)
Parameters
GCurve
Type: Autodesk.Revit.DB.Curve
 The curve to be added.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  GCurve is not acceptable for view-specific shape representation that is currently being built.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ViewShapeBuilder Class
Autodesk.Revit.DB Namespace